Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean,Autodesk.Revit.DB.XYZ)
Creates a non rectangular profile wall within the project using the specified wall type and normal vector.
document:
The document in which the new wall is created.
profile:
An array of planar lines and arcs that represent the vertical profile of the wall.
wallTypeId:
Id of the wall type to be used by the new wall instead of the default type.
levelId:
Id of the level on which the wall is to be placed.
structural:
If set, specifies that the wall is structural in nature.
normal:
A vector that must be perpendicular to the profile which dictates which side of the wall is considered to be inside and outside.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the wall.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a non rectangular profile wall within the project using the specified wall type.
document:
The document in which the new wall is created.
profile:
An array of planar lines and arcs that represent the vertical profile of the wall.
wallTypeId:
Id of the wall type to be used by the new wall instead of the default type.
levelId:
Id of the level on which the wall is to be placed.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the wall.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},System.Boolean)
Creates a non rectangular profile wall within the project using the default wall type.
document:
The document in which the new wall is created.
profile:
An array of planar lines and arcs that represent the vertical profile of the wall.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the wall.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Double,System.Double,System.Boolean,System.Boolean)
Creates a new rectangular profile wall within the project using the specified wall type, height, and offset.
document:
The document in which the new wall is created.
curve:
An arc or line representing the base line of the wall.
wallTypeId:
Id of the wall type to be used by the new wall instead of the default type.
levelId:
Id of the level on which the wall is to be placed.
height:
The height of the wall other than the default height.
offset:
Modifies the wall's Base Offset parameter to determine its vertical placement.
flip:
Change which side of the wall is considered to be the inside and outside of the wall.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The curve argument is not valid for rectangular wall creation.
-or-
The input curve points to a helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for height must be greater than 0 and no more than 30000 feet.
-or-
The given value for offset must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a new rectangular profile wall within the project using the default wall style.
document:
The document in which the new wall is created.
curve:
An arc or line representing the base line of the wall.
levelId:
Id of the level on which the wall is to be placed.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The curve argument is not valid for rectangular wall creation.
-or-
The input curve points to a helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Flip
The wall orientation will be flipped.

Autodesk.Revit.DB.Wall.GetStackedWallMemberIds
Get the sub walls which belongs to the wall.
Returns:
If the wall is a stacked wall, the Ids of the sub will be returned in bottom-top order.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This wall isn't a consistent stacked wall.
Since:
2015

Autodesk.Revit.DB.Wall.Orientation
The normal vector projected from the exterior side of the wall.

Autodesk.Revit.DB.Wall.StackedWallOwnerId
Gets the stacked wall which contains this stacked wall member.
Since:
2015

Autodesk.Revit.DB.Wall.IsStackedWallMember
Identifies if the wall is a member of a stacked wall.
Since:
2015

Autodesk.Revit.DB.Wall.IsStackedWall
Identifies if the wall is a stacked wall.
Since:
2015

Autodesk.Revit.DB.Wall.Flipped
Property to test whether the wall orientation is flipped.

Autodesk.Revit.DB.Wall.StructuralUsage
Retrieves or changes  the wall's designated structural usage.
The wall's designated structural usage, such as bearing or non bearing.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The enum value is not invalid for StructuralWallUsage.
-or-
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Wall.Width
Get the overall thickness of the wall.

Autodesk.Revit.DB.Wall.CurtainGrid
Get the grid object of a curtain wall
Remarks:  This property is readonly.

Autodesk.Revit.DB.Wall.WallType
Retrieves or changes the type of the wall.
Remarks: The WallType property can be used to retrieve the kind of the wall. This property can also
be used to change the type of a wall by setting it to a different wall type. All the wall types in
the project can be found using the Document.WallTypes property.

Autodesk.Revit.DB.Wall
Represents a wall in Autodesk Revit.
Remarks:
The wall object represents all the different kinds of walls in Revit.